#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/GithubActionsORG/ci-cd-staging/runs/run-xQRFjQ14gnHo9uCp

Waiting for the plan to start...

Terraform v1.10.4
on linux_amd64
Initializing plugins and modules...
random_id.server: Refreshing state... [id=eXM58n-5jfo]
random_id.server_PR_19: Refreshing state... [id=0zhUB5jusAI]
aws_key_pair.staging_key: Refreshing state... [id=staging-key]
aws_instance.staging_cicd_demo: Refreshing state... [id=i-00de9feb963c20e1c]
aws_instance.staging_cicd_demo_PR_19: Refreshing state... [id=i-090001e91802a0799]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_key_pair.staging_key must be replaced
-/+ resource "aws_key_pair" "staging_key" {
      ~ arn             = "arn:aws:ec2:eu-west-1:872515288273:key-pair/staging-key" -> (known after apply)
      ~ fingerprint     = "9a:00:a6:49:08:68:26:57:89:c4:ab:a0:e7:fe:66:33" -> (known after apply)
      ~ id              = "staging-key" -> (known after apply)
      + key_name_prefix = (known after apply)
      ~ key_pair_id     = "key-058e0e5b1b09fbb4c" -> (known after apply)
      ~ public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDG3wkESTPtwnhGAB1oC8mTMsbILmjozuGvQap/+oWLbpP6pFVv6H0N7ybhYRMBikZUvnA6n1ALkLp/0W8FwnKaxLP1UBiHqrUFbTEd1U9NgvS8Kdijl7/RXl6Vs+RSrFqQf/XdU0pvJL6CnkJHNxuKouGW9MxjkcLzoP/B7Yz57qK8/y/9tu0P8c+Kg7/YYUscYyXyoPW157YYF+lH5MhPO8vu/syz1m/zwY+sAtXq1ZQHSAOe5L7bZFUXxBlkC4adCvrvcKH7bw/KmRKIlW11seBg5Zeyk/KEYhD2wQHw7Ek02ztEWXBcxH0+Vesog8mLXt5AiDQdnrV0cqtczycTdDcX0evMruCOMdP50cJme+q+2IdJkgl5Lxa/uz5SZdGmwBN2rfdodGRIOp0TA5OW32l6mxXodRi98JFfBkxVyk2/NomBLTVOYZHndmae26vQUB1Z0Ij0a4YZxVRcPjYRgVcYEWjelZrFnMDrr98MaS0XDBhbN7WoRJQKzjV3HrY/dZBg4f/GXsaMet+6y4DrabbNbnjKL9WDoAT+GNQt2UMwYToH1vXFyWeykX+xUgZGEFdq0+Z2+lPqZNVScdCO4U6m6B+NvWEpxMqJBZcqhVY8z7omE5vq/KTwtAQ8ByS1pP6MAqle2GtUxD4oUR32UAPP1yxoKQ67/G546slv+Q== ssh-key" -> "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQCz6Sr2IxQyb/uXin8v+nNI4xgQ8K1arVuxNaz8grnuCpFd0Ib1K5FuTQ8e+BLbhQpOVKEPtyiyWZaI1ZUz89g49JVf4k0KegYBCCO0aMeVbKPvB96X4J7cV5DsyCgdkuu3esTdI97H0wgkeg1PfrCM0eYjYQ631iKR9kY9VX0QzB4u2yZUMV5R1Q9bTbmwliXqZZ0gyU4iEHuby3TssH05wxLrEJWvP5dKQj54Hw/haVaVVsR7r4sNMLAf35KdCBFVm+2qMwKqcNELKvj3uui3tvrUPIEhxwIbeZLY9ezLBxEKD36Ve0syvwxGOtDak6iGPrwO2Tvyb0YaHJ+IlR4v my-unix@DESKTOP-BN3BPDU" # forces replacement
        tags            = {
            "Name" = "staging_public_key"
        }
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.


```

</details>

*Pusher: @Rafael-Ya, Action: `workflow_dispatch`*